{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "Ċ": 3,
      "11": 4,
      "00": 5,
      "10": 6,
      "100": 7,
      "1111": 8,
      "110": 9,
      "1100": 10,
      "1000": 11,
      "1010": 12,
      "10000": 13,
      "1110": 14,
      "11110": 15,
      "111100": 16,
      "11100": 17,
      "11000": 18,
      "110000": 19,
      "10100": 20,
      "10110": 21,
      "11111111": 22,
      "100000": 23,
      "1000000": 24,
      "111": 25,
      "110100": 26,
      "111000": 27,
      "11010": 28,
      "10010": 29,
      "111010": 30,
      "111110": 31,
      "1111110": 32,
      "100100": 33,
      "101": 34,
      "1100000": 35,
      "101000": 36,
      "101100": 37,
      "1101": 38,
      "1111000": 39,
      "11111110": 40,
      "1110000": 41,
      "100110": 42,
      "1001100": 43,
      "11000000": 44,
      "1001": 45,
      "101110": 46,
      "101111": 47,
      "111111110": 48,
      "11110000": 49,
      "1011": 50,
      "11111100": 51,
      "1101000": 52,
      "11101": 53,
      "11111": 54,
      "1001000": 55,
      "10000000": 56
    },
    "merges": [
      [
        "1",
        "1"
      ],
      [
        "0",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "10",
        "10"
      ],
      [
        "100",
        "00"
      ],
      [
        "11",
        "10"
      ],
      [
        "1111",
        "0"
      ],
      [
        "1111",
        "00"
      ],
      [
        "11",
        "100"
      ],
      [
        "1100",
        "0"
      ],
      [
        "1100",
        "00"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "110"
      ],
      [
        "1111",
        "1111"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "11",
        "1"
      ],
      [
        "110",
        "100"
      ],
      [
        "11",
        "1000"
      ],
      [
        "110",
        "10"
      ],
      [
        "100",
        "10"
      ],
      [
        "11",
        "1010"
      ],
      [
        "1111",
        "10"
      ],
      [
        "1111",
        "110"
      ],
      [
        "100",
        "100"
      ],
      [
        "10",
        "1"
      ],
      [
        "110000",
        "0"
      ],
      [
        "10",
        "1000"
      ],
      [
        "10",
        "1100"
      ],
      [
        "110",
        "1"
      ],
      [
        "111100",
        "0"
      ],
      [
        "1111",
        "1110"
      ],
      [
        "11",
        "10000"
      ],
      [
        "100",
        "110"
      ],
      [
        "100",
        "1100"
      ],
      [
        "110000",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "10",
        "1110"
      ],
      [
        "10",
        "1111"
      ],
      [
        "1111",
        "11110"
      ],
      [
        "111100",
        "00"
      ],
      [
        "10",
        "11"
      ],
      [
        "1111",
        "1100"
      ],
      [
        "110",
        "1000"
      ],
      [
        "1110",
        "1"
      ],
      [
        "1111",
        "1"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1000000",
        "0"
      ]
    ]
  }
}